/*Основне завдання, cтворити скрипт яки повинен виконувати наступне:
запитати у користувача рік народження;
запитати в нього, в якому місті він живе;
запитати його улюблений вид спорту.
При натисканні на ОК показуємо вікно, де має бути відображена наступна інформація:

його вік;
якщо користувач вкаже Київ, Вашингтон чи Лондон, то показати йому повідомлення - "Ти живеш у столиці..." і на місце точок підставляємо країну, столицею якої є місто. Інакше показуємо йому “ти живеш у місті…”, де місце точок – введене місто.
Додаткове завдання *
Вибираємо самі три види спорту та три чемпіони у цих видах. Відповідно, якщо користувач вкаже один із цих видів спорту, то показуємо йому повідомлення “Круто! Хочеш стати …? і підставляємо на місце точок ім'я та прізвище чемпіона.

Все це має бути відображено в одному вікні (алерті).

Додаткове завдання
Якщо в якомусь випадку він не захоче вводити інформацію і натисне Скасувати, показати йому повідомлення – “Шкода, що Ви не захотіли ввести свій(ю) …” і вказуємо, що він не захотів вводити – дату народження, місто чи вид спорту .*/

let birthYear = prompt('Введіть свій рік народження');
let city = prompt('Введіть в якому місті ви живе');
let sport = prompt('Введіть ваш улюблений вид спорту');
let message = '';

if (birthYear === null || birthYear.trim() === '') {
    message += 'Шкода, що ти не захотів ввести свій рік народження.\n';
} else {
    let age = 2025 - +birthYear;
    message += 'Тобі ' + age + ' років.\n';
}

if (city === null || city.trim() === '') {
    message += 'Шкода, що ти не захотів ввести місто.\n';
} else {
    switch (city.toLowerCase()) {
        case 'київ':
            message += 'Ти живеш у столиці України.\n';
            break;
        case 'лондон':
            message += 'Ти живеш у столиці Великої Британії.\n';
            break;
        case 'вашингтон':
            message += 'Ти живеш у столиці США.\n';
            break;
        default:
            message += 'Ти живеш у місті ' + city + '.\n';
            break;
    }
}

if (sport === null || sport.trim() === '') {
    message += 'Шкода, що ти не захотів ввести улюблений вид спорту.\n';
} else {
    switch (sport.toLowerCase()) {
        case 'футбол':
            message += 'Круто! Ти хочеш стати як Олександр Зінченко.\n';
            break;
        case 'баскетбол':
            message += 'Круто! Ти хочеш стати як Леброн Джеймс.\n';
            break;
        case 'бокс':
            message += 'Круто! Ти хочеш стати як Олександр Усик.\n';
            break;
        default:
            message += 'Твій улюблений спорт — ' + sport + '.\n';
            break;
    }
}

alert(message);