/*Вивести на консоль в один рядок через кому числа від 10 до 20.*/
console.log('Вивести на консоль в один рядок через кому числа від 10 до 20.');
let mes = '';
for (let i = 10; i <= 20; i++) {
    mes = mes + `${i}`+', ' ;
}
console.log(mes);

/*Вивести квадрати чисел від 10 до 20 (100, 121, 144, … 400).*/
console.log('Вивести квадрати чисел від 10 до 20 (100, 121, 144, … 400).');
for (let q = 10; q <= 20; q++) {
    console.log(q*q);
}

/*Знайти суму всіх цілих чисел від 1 до 15.*/
console.log('Знайти суму всіх цілих чисел від 1 до 15.');
let sum=0;
for (let w = 1; w <= 15; w++) {
    sum=sum+w;
}
console.log(sum);

/*Знайти добуток усіх цілих чисел від 1 до 4.*/
console.log('Знайти добуток усіх цілих чисел від 1 до 4.');
let sm=1;
for(e=1; e<=4; e++){
    sm=sm*e;
}
console.log(sm);

/*Знайти середнє арифметичне всіх цілих чисел від 1 до 500 (250.5).*/
console.log('Знайти середнє арифметичне всіх цілих чисел від 1 до 500 (250.5).');
let smary=0;
let cofic=0;
for(r=1; r<=500; r++){
    smary=smary+r;
    cofic++;
}
console.log(smary/cofic);

/*Вивести на консоль суму лише парних чисел у діапазоні від 30 до 80.*/
console.log('Вивести на консоль суму лише парних чисел у діапазоні від 30 до 80.');
let sma=0;
for(t=30; t<=80; t++){
    if(t%2===0){
        sma=sma+t;
    }
}
console.log(sma);

/*Вивести на консоль усі числа в діапазоні від 100 до 200, кратні 3.*/
console.log('Вивести на консоль усі числа в діапазоні від 100 до 200, кратні 3.');
for(y=100; y<=200; y++){ 
    if(y%3===0){ 
        console.log(y);
    }
}

/*Надрукувати повну таблицю множення від 2 до 10.*/
console.log('Надрукувати повну таблицю множення від 2 до 10.');
for(z=2; z<=10; z++){  
     console.log(`Таблиця множення на ${z}`);
     for(x=1; x<=10; x++){
        let symma=z*x;
        console.log(`${z}*${x}=${symma}`)
     }
}